var rule = {
    类型: '影视',
    title: '秋霞电影网',
    //编码: 'UTF-8',
    desc: '不告诉你',
    host: 'https://www.llyady.cc',
    url:'/vodshow/fyfilter.html',
    searchUrl: '/search/**--fypage-----------.html',
    headers: {'User-Agent': 'MOBILE_UA','accept':'*/*'},
    searchable: 2,quickSearch: 0,timeout: 5000,play_parse: true,double: true,filterable: 1,
    filter_url: '{{fl.cateId}}-{{fl.area}}-{{fl.class}}--{{fl.year}}-------fypage',
    filter_def: {'1': {cateId: '1'},'2': {cateId: '2'},'3': {cateId: '3'},'4': {cateId: '4'},'9': {cateId: '9'},'50': {cateId: '50'}},
    class_name: '电影&电视剧&动漫&综艺&短剧&其它',
    class_url: '1&2&4&3&9&50',
    预处理: async () => {
        return []
    },
    推荐: async function (tid, pg, filter, extend) {
        let {input, pdfa, pdfh, pd} = this;
        let html = await request(input);
        let d = [];
        let data = pdfa(html, '.ysList6 a');
        data.forEach((it) => {
            d.push({
                title: pdfh(it, 'img&&alt'),
                pic_url: pd(it, 'img&&data-src'),
                desc: pdfh(it, ''),
                url: pd(it, 'a&&href'),
            })
        });
        return setResult(d)
    },
    一级: async function (tid, pg, filter, extend) {
        let {input, pdfa, pdfh, pd} = this;
        let html = await request(input);
        let d = [];
        //log(html);
        let data = pdfa(html, '.ysList6 a');
        log(data.length)
        data.forEach((it) => {
           //log(it);
            d.push({
                title: pdfh(it, 'img&&alt'),
                pic_url: pd(it, 'img&&data-src'),
                desc: pdfh(it, ''),
                url: pd(it, 'a&&href'),
            })
        });
        log(d);
        return setResult(d)
    },
    二级: async function (ids) {
        let {input, pdfa, pdfh, pd} = this;
        let html = await request(input);
        let VOD = {};
        VOD.vod_name = pdfh(html, '.ys-name18&&Text');
        VOD.vod_content = pdfh(html, '.Synopsis-word&&Text');
        let playlist = pdfa(html, '.list-number1');
        let tabs = pdfa(html, '.list-name17 .list-left17');
        let playmap = {};
        tabs.map((item, i) => {
            const form = pdfh(item, 'Text');
            const list = playlist[i];
            const a = pdfa(list, 'body&&a');
            a.map((it) => {
                let title = pdfh(it, 'a&&Text');
                let urls = pd(it, 'a&&href', input);
                if (!playmap.hasOwnProperty(form)) {
                    playmap[form] = [];
                }
                playmap[form].push(title + "$" + urls);
            });
        });
        VOD.vod_play_from = Object.keys(playmap).join('$$$');
        const urls = Object.values(playmap);
        const playUrls = urls.map((urllist) => {
            return urllist.join("#");
        });
        VOD.vod_play_url = playUrls.join('$$$');
        return VOD;
    },
    搜索: async function (wd, quick, pg) {
        let {input, pdfa, pdfh, pd} = this;
        let html = await request(input);
        let d = [];
        let data = pdfa(html, '.ysList6 a');
        data.forEach((it) => {
            d.push({
                title: pdfh(it, 'img&&alt'),
                pic_url: pd(it, 'img&&data-src'),
                desc: pdfh(it, ''),
                url: pd(it, 'a&&href'),
                content: pdfh(it, ''),
            })
        });
        return setResult(d);
    },
    lazy: async function (flag, id, flags) {
        let {input, pdfa, pdfh, pd} = this;
        let html = await request(input);
        html = JSON.parse(html.match(/r player_.*?=(.*?)</)[1]);
        let url = html.url;
        if (html.encrypt == "1") {
            url = unescape(url)
            return {parse: 0, url: url}
        } else if (html.encrypt == "2") {
            url = unescape(base64Decode(url))
            return {parse: 0, url: url}
        }
        if (/m3u8|mp4/.test(url)) {
            input = url
            return {parse: 0, url: input}
        } else {
            return {parse: 0, url: input}
        }
    },
    filter:{"1":[{"key":"class","name":"剧情","value":[{"n":"全部","v":""},{"n":"喜剧","v":"喜剧"},{"n":"爱情","v":"爱情"},{"n":"恐怖","v":"恐怖"},{"n":"动作","v":"动作"},{"n":"科幻","v":"科幻"},{"n":"剧情","v":"剧情"},{"n":"战争","v":"战争"},{"n":"警匪","v":"警匪"},{"n":"犯罪","v":"犯罪"},{"n":"动画","v":"动画"},{"n":"奇幻","v":"奇幻"},{"n":"武侠","v":"武侠"},{"n":"冒险","v":"冒险"},{"n":"枪战","v":"枪战"},{"n":"悬疑","v":"悬疑"},{"n":"惊悚","v":"惊悚"},{"n":"经典","v":"经典"},{"n":"青春","v":"青春"},{"n":"文艺","v":"文艺"},{"n":"微电影","v":"微电影"},{"n":"理论","v":"伦理"},{"n":"古装","v":"古装"},{"n":"历史","v":"历史"},{"n":"运动","v":"运动"},{"n":"农村","v":"农村"},{"n":"儿童","v":"儿童"},{"n":"网络电影","v":"网络电影"}]},{"key":"area","name":"地区","value":[{"n":"全部","v":""},{"n":"中国大陆","v":"中国大陆"},{"n":"香港","v":"香港"},{"n":"台湾","v":"台湾"},{"n":"美国","v":"美国"},{"n":"法国","v":"法国"},{"n":"英国","v":"英国"},{"n":"日本","v":"日本"},{"n":"韩国","v":"韩国"},{"n":"德国","v":"德国"},{"n":"泰国","v":"泰国"},{"n":"印度","v":"印度"},{"n":"意大利","v":"意大利"},{"n":"西班牙","v":"西班牙"},{"n":"加拿大","v":"加拿大"},{"n":"其他","v":"其他"}]},{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2024","v":"2024"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"},{"n":"2011","v":"2011"},{"n":"2010","v":"2010"}]}],
    "2":[{"key":"class","name":"剧情","value":[{"n":"全部","v":""},{"n":"古装","v":"古装"},{"n":"战争","v":"战争"},{"n":"青春偶像","v":"青春偶像"},{"n":"喜剧","v":"喜剧"},{"n":"家庭","v":"家庭"},{"n":"犯罪","v":"犯罪"},{"n":"动作","v":"动作"},{"n":"奇幻","v":"奇幻"},{"n":"剧情","v":"剧情"},{"n":"历史","v":"历史"},{"n":"经典","v":"经典"},{"n":"乡村","v":"乡村"},{"n":"情景","v":"情景"},{"n":"商战","v":"商战"},{"n":"网剧","v":"网剧"},{"n":"理论","v":"伦理"},{"n":"其他","v":"其他"}]},{"key":"area","name":"地区","value":[{"n":"全部","v":""},{"n":"中国大陆","v":"中国大陆"},{"n":"香港","v":"香港"},{"n":"台湾","v":"台湾"},{"n":"美国","v":"美国"},{"n":"法国","v":"法国"},{"n":"英国","v":"英国"},{"n":"日本","v":"日本"},{"n":"韩国","v":"韩国"},{"n":"德国","v":"德国"},{"n":"泰国","v":"泰国"},{"n":"印度","v":"印度"},{"n":"意大利","v":"意大利"},{"n":"西班牙","v":"西班牙"},{"n":"加拿大","v":"加拿大"},{"n":"其他","v":"其他"}]},{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2024","v":"2024"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"},{"n":"2011","v":"2011"},{"n":"2010","v":"2010"}]}],
"3":[{"key":"class","name":"剧情","value":[{"n":"全部","v":""},{"n":"选秀","v":"选秀"},{"n":"情感","v":"情感"},{"n":"访谈","v":"访谈"},{"n":"播报","v":"播报"},{"n":"旅游","v":"旅游"},{"n":"音乐","v":"音乐"},{"n":"美食","v":"美食"},{"n":"纪实","v":"纪实"},{"n":"曲艺","v":"曲艺"},{"n":"生活","v":"生活"},{"n":"游戏互动","v":"游戏互动"},{"n":"财经","v":"财经"},{"n":"求职","v":"求职"}]},{"key":"area","name":"地区","value":[{"n":"全部","v":""},{"n":"中国大陆","v":"中国大陆"},{"n":"港台","v":"港台"},{"n":"日韩","v":"日韩"},{"n":"欧美","v":"欧美"}]},{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2024","v":"2024"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"},{"n":"2011","v":"2011"},{"n":"2010","v":"2010"}]}],
"4":[{"key":"class","name":"剧情","value":[{"n":"全部","v":"4"},{"n":"动作","v":"动作"},{"n":"动画","v":"动画"},{"n":"奇幻","v":"奇幻"},{"n":"冒险","v":"冒险"},{"n":"科幻","v":"科幻"},{"n":"喜剧","v":"喜剧"},{"n":"剧情","v":"剧情"},{"n":"武侠","v":"武侠"},{"n":"爱情","v":"爱情"},{"n":"历史","v":"历史"},{"n":"战争","v":"战争"},{"n":"悬疑","v":"悬疑"},{"n":"其他","v":"其他"}]},{"key":"area","name":"地区","value":[{"n":"全部","v":""},{"n":"国产","v":"中国大陆"},{"n":"日本","v":"日本"},{"n":"欧美","v":"欧美"},{"n":"其他","v":"其他"}]},{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2024","v":"2024"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"},{"n":"2011","v":"2011"},{"n":"2010","v":"2010"}]}],
"9":[{"key":"cateId","name":"类型","value":[{"n":"全部","v":"9"},{"n":"热点","v":"56"},{"n":"影视解说","v":"57"},{"n":"短剧","v":"58"},{"n":"头条","v":"59"},{"n":"娱乐","v":"60"},{"n":"搞笑","v":"61"},{"n":"美女","v":"62"},{"n":"体育","v":"63"},{"n":"生活","v":"64"},{"n":"文化","v":"65"},{"n":"科技","v":"66"},{"n":"互联网","v":"67"},{"n":"创业","v":"68"},{"n":"音乐","v":"69"},{"n":"游戏","v":"70"},{"n":"汽车","v":"71"},{"n":"时尚","v":"72"},{"n":"直播","v":"73"},{"n":"记录片","v":"74"},{"n":"教育","v":"75"},{"n":"旅游","v":"76"},{"n":"财经","v":"77"},{"n":"综合","v":"78"}]},{"key":"class","name":"剧情","value":[{"n":"全部","v":""},{"n":"纪录片","v":"纪录片"},{"n":"体育","v":"体育"},{"n":"游戏","v":"游戏"},{"n":"音乐","v":"音乐"},{"n":"人文","v":"人文"},{"n":"直播","v":"直播"},{"n":"汽车","v":"汽车"},{"n":"娱乐","v":"娱乐"},{"n":"学堂","v":"学堂"},{"n":"搞笑","v":"搞笑"},{"n":"科技","v":"科技"},{"n":"生活","v":"生活"},{"n":"电竞","v":"电竞"},{"n":"时尚","v":"时尚"},{"n":"旅游","v":"旅游"},{"n":"亲子","v":"亲子"},{"n":"教育","v":"教育"},{"n":"财经","v":"财经"},{"n":"IT互联网","v":"IT互联网"},{"n":"历史","v":"历史"},{"n":"传记","v":"传记"},{"n":"歌舞","v":"歌舞"},{"n":"美女","v":"美女"},{"n":"其他","v":"其他"}]},{"key":"area","name":"地区","value":[{"n":"全部","v":""},{"n":"中国大陆","v":"中国大陆"},{"n":"香港","v":"香港"},{"n":"台湾","v":"台湾"},{"n":"美国","v":"美国"},{"n":"法国","v":"法国"},{"n":"英国","v":"英国"},{"n":"日本","v":"日本"},{"n":"韩国","v":"韩国"},{"n":"德国","v":"德国"},{"n":"泰国","v":"泰国"},{"n":"印度","v":"印度"},{"n":"意大利","v":"意大利"},{"n":"西班牙","v":"西班牙"},{"n":"加拿大","v":"加拿大"},{"n":"其他","v":"其他"}]},{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2024","v":"2024"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"},{"n":"2011","v":"2011"},{"n":"2010","v":"2010"}]}],
"50":[{"key":"cateId","name":"类型","value":[{"n":"全部","v":"50"},{"n":"即将上映","v":"51"},{"n":"爱奇艺少女视频","v":"5"},{"n":"年轻的儿媳","v":"8"},{"n":"最好看的电视剧","v":"7"},{"n":"2018中文2019","v":"6"},{"n":"甜蜜惩罚动漫","v":"12"},{"n":"金瓶梅电影","v":"13"},{"n":"星辰影院打开视频","v":"14"},{"n":"追剧网","v":"15"},{"n":"中文翻译","v":"16"},{"n":"日本电影粤语","v":"29"},{"n":"好姑娘4影视剧","v":"30"},{"n":"初体验3","v":"31"},{"n":"免费观看完整版","v":"32"},{"n":"杨思敏版","v":"33"},{"n":"龚玥菲潘金莲","v":"34"},{"n":"小电影南瓜","v":"23"},{"n":"青柠影院西瓜","v":"24"},{"n":"隔壁女孩","v":"25"},{"n":"达达兔影视","v":"26"},{"n":"y8848高清私人","v":"27"},{"n":"观看动漫","v":"28"},{"n":"少女视频哔哩哔哩","v":"17"},{"n":"三年片免费观看","v":"18"},{"n":"樱桃榴莲茄子","v":"19"},{"n":"17岁高清版","v":"20"},{"n":"好姑娘3高清","v":"21"},{"n":"青青河边草高清","v":"22"}]},{"key":"class","name":"剧情","value":[{"n":"全部","v":""},{"n":"高清版","v":"高清版"},{"n":"免费在线","v":"免费在线"},{"n":"中文字幕","v":"中文字幕"},{"n":"完整版","v":"完整版"},{"n":"全集","v":"全集"},{"n":"手机在线","v":"手机在线"},{"n":"最近最新","v":"最近最新"},{"n":"在线观看","v":"在线观看"},{"n":"片多多","v":"片多多"},{"n":"美女视频","v":"美女视频"},{"n":"街拍","v":"街拍"},{"n":"泳装","v":"泳装"},{"n":"性感","v":"性感"},{"n":"清纯","v":"清纯"},{"n":"明星","v":"明星"},{"n":"番号","v":"番号"},{"n":"走光","v":"走光"},{"n":"日韩","v":"日韩"},{"n":"欧美","v":"欧美"},{"n":"台湾","v":"台湾"}]},{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2024","v":"2024"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"},{"n":"2011","v":"2011"},{"n":"2010","v":"2010"}]}]}
}
